In [2]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np

engine = create_engine('mysql+pymysql://root:password@localhost')

In [3]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                query = text(query)
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [4]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

              Database
0         email_portal
1                house
2   information_schema
3           leadsource
4     leadsource_test1
5     leadsource_test2
6     leadsource_test3
7     leadsource_test4
8                mysql
9            northwind
10        order_portal
11  performance_schema
12         sarker_fish
13        sql_practice
14                 sys
15             thakrai
16             trademe

In [5]:
query = """
use sql_practice;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [6]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

  Tables_in_sql_practice
0                  books

In [7]:
query = """
select * from books;
"""
get_query_result(query)

Query executed successfully and returned data.

,book_id,title,author_first_name,author_last_name,release_year,stock_quantity,pages
0,1,The Namesake,Jhumpa,Lahiri,2003,32,291
1,2,Norse Mythology,Neil,Gaiman,2016,43,304
2,3,American Gods,Neil,Gaiman,2001,12,465
3,4,Interpreter of Maladies,Jhumpa,Lahiri,1996,97,198
4,5,A Hologram for the King: A Novel,Dave,Eggers,2012,154,352
5,6,The Circle,Dave,Eggers,2013,26,504
6,7,The Amazing Adventures of Kavalier & Clay,Michael,Chabon,2000,68,634
7,8,Just Kids,Patti,Smith,2010,55,304
8,9,A Heartbreaking Work of Staggering Genius,Dave,Eggers,2001,104,437
9,10,Coraline,Neil,Gaiman,2003,100,208
10,11,What We Talk About When We Talk About Love: St...,Raymond,Carver,1981,23,176
11,12,Where I'm Calling From: Selected Stories,Raymond,Carver,1989,12,526
12,13,White Noise,Don,DeLillo,1985,49,320
13,14,Cannery Row,John,Steinbeck,1945,95,181
14,15,Oblivion: Stories,David,Foster Wallace,2004,172,329
15,16,Consider the Lobster,David,Foster Wallace,2005,92,343
16,17,10% Happier,Dan,Harris,2014,29,256
17,18,fake_book,Freida,Harris,2001,287,428
18,19,Lincoln In The Bardo,George,Saunders,2017,1000,367
19,20,10% Happier,Dan,Harris,2014,29,256
20,21,fake_book,Freida,Harris,2001,287,428
21,22,Lincoln In The Bardo,George,Saunders,2017,1000,367

## **`DATE`**, **`TIME`**, **`DATETIME`**, and **`TIMESTAMP`**

In databases, **`DATE`**, **`TIME`**, **`DATETIME`**, and **`TIMESTAMP`** are used to store date and time values. However, the exact terminology and behavior can vary between different database management systems (DBMS). Here’s a breakdown of these common types:

### **1. `DATE`:**
- **Purpose:** Stores only date information (year, month, day).
- **Format:** `YYYY-MM-DD`
- **Range:** Typically from `0001-01-01` to `9999-12-31`.
- **Example Value:** `2024-08-22`

### **2. `TIME`:**
- **Purpose:** Stores only time information (hours, minutes, seconds).
- **Format:** `HH:MM:SS` (24-hour format).
- **Range:** Usually from `00:00:00` to `23:59:59`.
- **Example Value:** `14:30:00`

### **3. `DATETIME`:**
- **Purpose:** Stores both date and time information.
- **Format:** `YYYY-MM-DD HH:MM:SS`
- **Range:** The range depends on the database system. For example, in MySQL, it’s from `1000-01-01 00:00:00` to `9999-12-31 23:59:59`.
- **Example Value:** `2024-08-22 14:30:00`

### **4. `TIMESTAMP`:**
- **Purpose:** Stores both date and time, often used to track changes or events.
- **Format:** `YYYY-MM-DD HH:MM:SS`
- **Range:** Usually similar to `DATETIME` but can be more restricted or have different behavior depending on the database system. For instance, in MySQL, it typically ranges from `1970-01-01 00:00:01` to `2038-01-19 03:14:07` and is affected by the system’s timezone.
- **Example Value:** `2024-08-22 14:30:00`

### Key Differences and Considerations:

1. **`DATETIME` vs. `TIMESTAMP`:**
   - **`DATETIME`:** Stores absolute date and time values without timezone considerations. The stored value is the same regardless of timezone.
   - **`TIMESTAMP`:** Often includes timezone information, meaning the stored value is converted to UTC internally and displayed according to the current timezone setting. This can be useful for applications that require timezone-aware timestamps.

2. **Default Values and Auto-updating:**
   - **`TIMESTAMP`:** In some systems (like MySQL), `TIMESTAMP` columns can automatically update to the current time when a record is modified if configured with the `DEFAULT CURRENT_TIMESTAMP` and `ON UPDATE CURRENT_TIMESTAMP` options.
   - **`DATETIME`:** Typically does not have automatic update features and is manually set or updated.

3. **Precision and Storage:**
   - **`DATETIME`** and **`TIMESTAMP`** may have different precision levels depending on the database system. For instance, some systems allow fractional seconds.

### Example Usage in SQL:

**Creating Tables:**

```sql
CREATE TABLE Events (
    event_date DATE,
    event_time TIME,
    event_datetime DATETIME,
    event_timestamp TIMESTAMP
);
```

**Inserting Values:**

```sql
INSERT INTO Events (event_date, event_time, event_datetime, event_timestamp)
VALUES ('2024-08-22', '14:30:00', '2024-08-22 14:30:00', CURRENT_TIMESTAMP);
```

### Summary:

- **`DATE`**: Stores only the date.
- **`TIME`**: Stores only the time.
- **`DATETIME`**: Stores both date and time, often without timezone considerations.
- **`TIMESTAMP`**: Stores date and time with possible timezone adjustments and auto-update features.

Choose the type based on your requirements for storing and manipulating date and time data in your database.

##  **`DAY`**, **`MONTH`**, and **`WEEK`**

In databases, **`DAY`**, **`MONTH`**, and **`WEEK`** are often used to represent or extract specific parts of date values or to perform calculations involving dates. These are not standalone data types but rather components or functions used within date and time operations. Here’s how they typically function:

### 1. **`DAY`:**
   - **Purpose:** Represents the day part of a date.
   - **Usage:** Often used to extract the day from a `DATE`, `DATETIME`, or `TIMESTAMP` field.
   - **Example:**
     - **SQL Query:** Extract the day from a date.
       ```sql
       SELECT DAY('2024-08-22');  -- Returns 22
       ```
     - **Result:** The `DAY` function returns the day portion (`22`) of the date `2024-08-22`.

### 2. **`MONTH`:**
   - **Purpose:** Represents the month part of a date.
   - **Usage:** Used to extract or work with the month component of a `DATE`, `DATETIME`, or `TIMESTAMP`.
   - **Example:**
     - **SQL Query:** Extract the month from a date.
       ```sql
       SELECT MONTH('2024-08-22');  -- Returns 8
       ```
     - **Result:** The `MONTH` function returns the month portion (`8`) of the date `2024-08-22`.

### 3. **`WEEK`:**
   - **Purpose:** Represents the week number of a date.
   - **Usage:** Used to extract the week number from a `DATE`, `DATETIME`, or `TIMESTAMP`. The first week of the year is typically considered as the one containing January 1st, but this can vary depending on the database system and its settings (e.g., the starting day of the week).
   - **Example:**
     - **SQL Query:** Extract the week number from a date.
       ```sql
       SELECT WEEK('2024-08-22');  -- Returns 34 (assuming ISO week numbers)
       ```
     - **Result:** The `WEEK` function returns the week number (`34`) of the year for the date `2024-08-22`.

### Practical Uses:
- **Date Extraction:** Extracting `DAY`, `MONTH`, or `WEEK` from a full date value for reporting, sorting, or filtering.
  - **Example:** Retrieve all records from a specific month.
    ```sql
    SELECT * FROM Orders WHERE MONTH(order_date) = 8;  -- Retrieves all orders from August
    ```

- **Date Calculations:** Calculating intervals like the difference in days, weeks, or months between two dates.
  - **Example:** Calculate the number of days between two dates.
    ```sql
    SELECT DATEDIFF('2024-08-22', '2024-08-01');  -- Returns 21
    ```

- **Grouping by Date Part:** Grouping data by day, month, or week for aggregation purposes.
  - **Example:** Count the number of orders per week.
    ```sql
    SELECT WEEK(order_date) AS order_week, COUNT(*) AS total_orders
    FROM Orders
    GROUP BY order_week;
    ```

### Summary:
- **`DAY`**, **`MONTH`**, and **`WEEK`** are components used within date and time functions to extract or manipulate specific parts of a date.
- **`DAY`** retrieves the day number, **`MONTH`** retrieves the month number, and **`WEEK`** retrieves the week number from a date.
- These components are useful for date-related calculations, filtering, and grouping in SQL queries.

## date and time functions

Many databases provide a variety of date and time functions that allow you to extract specific parts of a date or perform calculations involving dates. Below are some of the most commonly used functions, including how to extract the month name, day of the week, day of the year, and other useful operations.

### 1. **`MONTHNAME`**: Get the Name of the Month
   - **Purpose:** Returns the full name of the month (e.g., January, February).
   - **Example:**
     ```sql
     SELECT MONTHNAME('2024-08-22');  -- Returns 'August'
     ```

### 2. **`DAYOFWEEK`**: Get the Day of the Week (1 = Sunday, 7 = Saturday)
   - **Purpose:** Returns the day of the week as a number, with 1 typically representing Sunday and 7 representing Saturday.
   - **Example:**
     ```sql
     SELECT DAYOFWEEK('2024-08-22');  -- Returns 5 (if Sunday is the first day of the week)
     ```

### 3. **`DAYNAME`**: Get the Name of the Day
   - **Purpose:** Returns the full name of the day of the week (e.g., Monday, Tuesday).
   - **Example:**
     ```sql
     SELECT DAYNAME('2024-08-22');  -- Returns 'Thursday'
     ```

### 4. **`DAYOFYEAR`**: Get the Day of the Year (1-366)
   - **Purpose:** Returns the day of the year as a number, from 1 to 366 (considering leap years).
   - **Example:**
     ```sql
     SELECT DAYOFYEAR('2024-08-22');  -- Returns 235 (the 235th day of the year)
     ```

### 5. **`WEEK`**: Get the Week Number of the Year
   - **Purpose:** Returns the week number of the year for a given date.
   - **Example:**
     ```sql
     SELECT WEEK('2024-08-22');  -- Returns 34 (34th week of the year)
     ```

### 6. **`YEAR`**: Get the Year
   - **Purpose:** Extracts the year from a date.
   - **Example:**
     ```sql
     SELECT YEAR('2024-08-22');  -- Returns 2024
     ```

### 7. **`MONTH`**: Get the Month Number (1-12)
   - **Purpose:** Extracts the month number from a date.
   - **Example:**
     ```sql
     SELECT MONTH('2024-08-22');  -- Returns 8
     ```

### 8. **`DAY`**: Get the Day of the Month (1-31)
   - **Purpose:** Extracts the day number from a date.
   - **Example:**
     ```sql
     SELECT DAY('2024-08-22');  -- Returns 22
     ```

### 9. **`HOUR`, `MINUTE`, `SECOND`**: Extract Time Components
   - **Purpose:** Extract the hour, minute, or second from a `DATETIME` or `TIME` value.
   - **Examples:**
     ```sql
     SELECT HOUR('2024-08-22 14:30:00');    -- Returns 14
     SELECT MINUTE('2024-08-22 14:30:00');  -- Returns 30
     SELECT SECOND('2024-08-22 14:30:00');  -- Returns 00
     ```

### 10. **`CURDATE()`**: Get the Current Date
   - **Purpose:** Returns the current date.
   - **Example:**
     ```sql
     SELECT CURDATE();  -- Returns the current date (e.g., '2024-08-22')
     ```

### 11. **`CURTIME()`**: Get the Current Time
   - **Purpose:** Returns the current time.
   - **Example:**
     ```sql
     SELECT CURTIME();  -- Returns the current time (e.g., '14:30:00')
     ```

### 12. **`NOW()`**: Get the Current Date and Time
   - **Purpose:** Returns the current date and time.
   - **Example:**
     ```sql
     SELECT NOW();  -- Returns the current date and time (e.g., '2024-08-22 14:30:00')
     ```

### 13. **`DATE_ADD` and `DATE_SUB`**: Add or Subtract Date/Time Intervals
   - **Purpose:** Adds or subtracts a specified interval (like days, months, years) from a date.
   - **Examples:**
     ```sql
     SELECT DATE_ADD('2024-08-22', INTERVAL 7 DAY);   -- Adds 7 days, returns '2024-08-29'
     SELECT DATE_SUB('2024-08-22', INTERVAL 1 MONTH); -- Subtracts 1 month, returns '2024-07-22'
     ```

### 14. **`DATEDIFF`**: Calculate the Difference Between Two Dates
   - **Purpose:** Returns the number of days between two dates.
   - **Example:**
     ```sql
     SELECT DATEDIFF('2024-08-22', '2024-08-01');  -- Returns 21 (days between the two dates)
     ```

### 15. **`LAST_DAY`**: Get the Last Day of the Month
   - **Purpose:** Returns the last day of the month for a given date.
   - **Example:**
     ```sql
     SELECT LAST_DAY('2024-08-22');  -- Returns '2024-08-31'
     ```

### Summary:
These functions are useful for manipulating and extracting specific parts of dates and times, performing date calculations, and generating date-based reports. Most relational database management systems (RDBMS) support these or similar functions, making them a key part of working with date and time data in SQL.

## **date formatting**

In databases, **date formatting** refers to converting a date or time value into a specific string representation. Different database systems offer various functions to format dates in the desired way. Here’s how you can format dates in some common database systems:

### 1. **MySQL: `DATE_FORMAT` Function**
   - **Syntax:** `DATE_FORMAT(date, format)`
   - **Purpose:** Converts a date or datetime into a string formatted according to a specified format.
   - **Common Format Specifiers:**
     - `%Y` - Year (4 digits)
     - `%y` - Year (2 digits)
     - `%M` - Full month name (e.g., January)
     - `%m` - Month (2 digits)
     - `%D` - Day with English suffix (e.g., 1st, 2nd)
     - `%d` - Day of the month (2 digits)
     - `%W` - Weekday name (e.g., Sunday)
     - `%H` - Hour (24-hour format)
     - `%h` - Hour (12-hour format)
     - `%i` - Minutes
     - `%s` - Seconds
     - `%p` - AM/PM

   - **Example:**
     ```sql
     SELECT DATE_FORMAT('2024-08-22 14:30:00', '%W, %M %d, %Y %h:%i %p');
     -- Returns 'Thursday, August 22, 2024 02:30 PM'
     ```

### 2. **SQL Server: `FORMAT` Function**
   - **Syntax:** `FORMAT(value, format, culture)`
   - **Purpose:** Returns a value formatted according to the specified format and culture.
   - **Common Format Specifiers:**
     - `yyyy` - Year (4 digits)
     - `yy` - Year (2 digits)
     - `MMMM` - Full month name
     - `MM` - Month (2 digits)
     - `dd` - Day of the month (2 digits)
     - `dddd` - Full day name
     - `HH` - Hour (24-hour format)
     - `hh` - Hour (12-hour format)
     - `mm` - Minutes
     - `ss` - Seconds
     - `tt` - AM/PM

   - **Example:**
     ```sql
     SELECT FORMAT(GETDATE(), 'dddd, MMMM dd, yyyy hh:mm tt');
     -- Returns 'Thursday, August 22, 2024 02:30 PM'
     ```

### 3. **PostgreSQL: `TO_CHAR` Function**
   - **Syntax:** `TO_CHAR(value, format)`
   - **Purpose:** Converts a timestamp or date to a string according to the specified format.
   - **Common Format Specifiers:**
     - `YYYY` - Year (4 digits)
     - `YY` - Year (2 digits)
     - `Month` - Full month name
     - `MM` - Month (2 digits)
     - `DD` - Day of the month (2 digits)
     - `Day` - Full day name
     - `HH24` - Hour (24-hour format)
     - `HH12` - Hour (12-hour format)
     - `MI` - Minutes
     - `SS` - Seconds
     - `AM` or `PM` - AM/PM

   - **Example:**
     ```sql
     SELECT TO_CHAR(NOW(), 'FMDay, Month DD, YYYY HH12:MI AM');
     -- Returns 'Thursday, August 22, 2024 02:30 PM'
     ```

### 4. **Oracle: `TO_CHAR` Function**
   - **Syntax:** `TO_CHAR(value, format)`
   - **Purpose:** Converts a date or number to a string using the specified format.
   - **Common Format Specifiers:**
     - `YYYY` - Year (4 digits)
     - `YY` - Year (2 digits)
     - `MONTH` - Full month name (padded with spaces)
     - `MM` - Month (2 digits)
     - `DD` - Day of the month (2 digits)
     - `DAY` - Full day name (padded with spaces)
     - `HH24` - Hour (24-hour format)
     - `HH12` - Hour (12-hour format)
     - `MI` - Minutes
     - `SS` - Seconds
     - `AM` or `PM` - AM/PM

   - **Example:**
     ```sql
     SELECT TO_CHAR(SYSDATE, 'FMDay, Month DD, YYYY HH12:MI AM');
     -- Returns 'Thursday, August 22, 2024 02:30 PM'
     ```

### 5. **SQLite: `strftime` Function**
   - **Syntax:** `strftime(format, datetime)`
   - **Purpose:** Formats a date/time according to the given format string.
   - **Common Format Specifiers:**
     - `%Y` - Year (4 digits)
     - `%m` - Month (2 digits)
     - `%d` - Day of the month (2 digits)
     - `%H` - Hour (24-hour format)
     - `%M` - Minutes
     - `%S` - Seconds

   - **Example:**
     ```sql
     SELECT strftime('%Y-%m-%d %H:%M:%S', '2024-08-22 14:30:00');
     -- Returns '2024-08-22 14:30:00'
     ```

### Custom Date Formats

Here’s how you can use different format specifiers to customize the output:

- **Long Date Format:** `Thursday, August 22, 2024`
  - **MySQL:** `'%W, %M %d, %Y'`
  - **SQL Server:** `'dddd, MMMM dd, yyyy'`
  - **PostgreSQL/Oracle:** `'FMDay, Month DD, YYYY'`

- **Short Date Format:** `08/22/2024`
  - **MySQL:** `'%m/%d/%Y'`
  - **SQL Server:** `'MM/dd/yyyy'`
  - **PostgreSQL/Oracle:** `'MM/DD/YYYY'`

- **Date and Time Format:** `08/22/2024 14:30`
  - **MySQL:** `'%m/%d/%Y %H:%i'`
  - **SQL Server:** `'MM/dd/yyyy HH:mm'`
  - **PostgreSQL/Oracle:** `'MM/DD/YYYY HH24:MI'`

### Summary:
Date formatting functions like `DATE_FORMAT`, `FORMAT`, `TO_CHAR`, and `strftime` allow you to convert date and time values into customized string representations in your database queries. The specific syntax and available format specifiers vary depending on the database system, so be sure to use the appropriate function and format for your environment.

## Date math functions

Date math functions in databases allow you to perform calculations involving dates, such as adding or subtracting time intervals, finding the difference between two dates, or determining the start and end of time periods. Here’s a guide to common date math functions across various database systems:

### 1. **MySQL**

- **`DATE_ADD(date, INTERVAL value unit)`**
  - **Purpose:** Adds a specified time interval to a date.
  - **Example:**
    ```sql
    SELECT DATE_ADD('2024-08-22', INTERVAL 10 DAY);   -- Returns '2024-09-01'
    SELECT DATE_ADD('2024-08-22', INTERVAL 1 MONTH);  -- Returns '2024-09-22'
    ```

- **`DATE_SUB(date, INTERVAL value unit)`**
  - **Purpose:** Subtracts a specified time interval from a date.
  - **Example:**
    ```sql
    SELECT DATE_SUB('2024-08-22', INTERVAL 10 DAY);   -- Returns '2024-08-12'
    SELECT DATE_SUB('2024-08-22', INTERVAL 1 MONTH);  -- Returns '2024-07-22'
    ```

- **`DATEDIFF(date1, date2)`**
  - **Purpose:** Returns the number of days between two dates.
  - **Example:**
    ```sql
    SELECT DATEDIFF('2024-08-22', '2024-08-01');  -- Returns 21
    ```

- **`TIMESTAMPDIFF(unit, datetime1, datetime2)`**
  - **Purpose:** Returns the difference between two dates in specified units (e.g., seconds, minutes, days).
  - **Example:**
    ```sql
    SELECT TIMESTAMPDIFF(DAY, '2024-08-01', '2024-08-22');  -- Returns 21
    ```

### 2. **SQL Server**

- **`DATEADD(datepart, number, date)`**
  - **Purpose:** Adds a specified number of units to a date.
  - **Example:**
    ```sql
    SELECT DATEADD(DAY, 10, '2024-08-22');   -- Returns '2024-09-01'
    SELECT DATEADD(MONTH, 1, '2024-08-22');  -- Returns '2024-09-22'
    ```

- **`DATEDIFF(datepart, startdate, enddate)`**
  - **Purpose:** Returns the difference between two dates in specified units.
  - **Example:**
    ```sql
    SELECT DATEDIFF(DAY, '2024-08-01', '2024-08-22');  -- Returns 21
    ```

- **`GETDATE()`**
  - **Purpose:** Returns the current date and time.
  - **Example:**
    ```sql
    SELECT GETDATE();  -- Returns the current date and time
    ```

### 3. **PostgreSQL**

- **`DATE_ADD(date, INTERVAL value unit)`** (In PostgreSQL, use `+` for adding intervals)
  - **Purpose:** Adds a specified time interval to a date.
  - **Example:**
    ```sql
    SELECT '2024-08-22'::date + INTERVAL '10 days';   -- Returns '2024-09-01'
    SELECT '2024-08-22'::date + INTERVAL '1 month';  -- Returns '2024-09-22'
    ```

- **`DATE_SUB(date, INTERVAL value unit)`** (In PostgreSQL, use `-` for subtracting intervals)
  - **Purpose:** Subtracts a specified time interval from a date.
  - **Example:**
    ```sql
    SELECT '2024-08-22'::date - INTERVAL '10 days';   -- Returns '2024-08-12'
    SELECT '2024-08-22'::date - INTERVAL '1 month';  -- Returns '2024-07-22'
    ```

- **`AGE(timestamp)`**
  - **Purpose:** Returns the interval between a given timestamp and the current time.
  - **Example:**
    ```sql
    SELECT AGE('2024-08-22'::timestamp);  -- Returns the interval between now and '2024-08-22'
    ```

- **`EXTRACT(field FROM date)`**
  - **Purpose:** Extracts a specific field from a date or timestamp.
  - **Example:**
    ```sql
    SELECT EXTRACT(DAY FROM '2024-08-22'::date);    -- Returns 22
    SELECT EXTRACT(MONTH FROM '2024-08-22'::date);  -- Returns 8
    SELECT EXTRACT(YEAR FROM '2024-08-22'::date);   -- Returns 2024
    ```

### 4. **Oracle**

- **`ADD_MONTHS(date, n)`**
  - **Purpose:** Adds a specified number of months to a date.
  - **Example:**
    ```sql
    SELECT ADD_MONTHS('2024-08-22', 1) FROM dual;  -- Returns '2024-09-22'
    ```

- **`SYSDATE`**
  - **Purpose:** Returns the current date and time.
  - **Example:**
    ```sql
    SELECT SYSDATE FROM dual;  -- Returns the current date and time
    ```

- **`MONTHS_BETWEEN(date1, date2)`**
  - **Purpose:** Returns the number of months between two dates.
  - **Example:**
    ```sql
    SELECT MONTHS_BETWEEN('2024-08-22', '2024-01-22') FROM dual;  -- Returns 7
    ```

- **`NEXT_DAY(date, 'day')`**
  - **Purpose:** Returns the date of the next specified day of the week.
  - **Example:**
    ```sql
    SELECT NEXT_DAY('2024-08-22', 'SUNDAY') FROM dual;  -- Returns '2024-08-25'
    ```

- **`TRUNC(date, 'unit')`**
  - **Purpose:** Truncates a date to the specified unit (e.g., year, month).
  - **Example:**
    ```sql
    SELECT TRUNC('2024-08-22', 'MONTH') FROM dual;  -- Returns '2024-08-01'
    SELECT TRUNC('2024-08-22', 'YEAR') FROM dual;   -- Returns '2024-01-01'
    ```

### 5. **SQLite**

- **`DATE(date, modifier, ...)`**
  - **Purpose:** Adds or subtracts time intervals from a date.
  - **Example:**
    ```sql
    SELECT DATE('2024-08-22', '+10 days');   -- Returns '2024-09-01'
    SELECT DATE('2024-08-22', '-1 month');  -- Returns '2024-07-22'
    ```

- **`JULIANDAY(date)`**
  - **Purpose:** Returns the Julian day number of a date.
  - **Example:**
    ```sql
    SELECT JULIANDAY('2024-08-22') - JULIANDAY('2024-08-01');  -- Returns 21
    ```

### Summary:

- **Adding/Subtracting Intervals:** Use functions like `DATE_ADD`, `DATE_SUB`, `DATEADD`, `INTERVAL`, etc., to perform date arithmetic.
- **Date Differences:** Functions like `DATEDIFF`, `TIMESTAMPDIFF`, `AGE`, and `MONTHS_BETWEEN` calculate the difference between dates.
- **Extracting Components:** Extract specific parts of dates using functions like `EXTRACT`, `DAY`, `MONTH`, `YEAR`, etc.
- **Current Date and Time:** Retrieve the current date and time with functions like `NOW()`, `GETDATE()`, `SYSDATE`, etc.

These functions are essential for managing and analyzing date and time data in SQL queries. Adjust the syntax according to the database system you are using.